Revit 2026 API

# TopographySurfaceGetHostedSubRegionIds Method

---

Gets the ids of all subregion elements hosted on this topography surface.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetHostedSubRegionIds()
```
```vb
Public Function GetHostedSubRegionIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetHostedSubRegionIds()
```
```fsharp
member GetHostedSubRegionIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId The hosted subregion ids.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This element is not a TopographySurface. |

This applies to a TopographySurface element (not a SiteSubRegion or a topography surface associated with a BuildingPad). This applies to TopographySurface and SiteSubRegion elements.

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace